balazsgrill/modembed/res/Devices/dsPIC30/DSPIC30F4011E.PIC
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="C1CFG1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="C1CFG1" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BRP" edc:desc="" edc:mask="0x3f" edc:name="BRP" edc:nzwidth="0x6"/>
              <edc:SFRFieldDef edc:cname="SJW" edc:desc="" edc:mask="0x3" edc:name="SJW" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="BRP0" edc:desc="" edc:mask="0x1" edc:name="BRP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP1" edc:desc="" edc:mask="0x1" edc:name="BRP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP2" edc:desc="" edc:mask="0x1" edc:name="BRP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP3" edc:desc="" edc:mask="0x1" edc:name="BRP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP4" edc:desc="" edc:mask="0x1" edc:name="BRP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRP5" edc:desc="" edc:mask="0x1" edc:name="BRP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SJW0" edc:desc="" edc:mask="0x1" edc:name="SJW0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SJW1" edc:desc="" edc:mask="0x1" edc:name="SJW1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-n---nnnnnnnnnnn" edc:cname="C1CFG2" edc:desc="" edc:impl="0x47ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0---00000000000" edc:name="C1CFG2" edc:nzwidth="0x10" edc:por="-x---xxxxxxxxxxx">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PRSEG" edc:desc="" edc:mask="0x7" edc:name="PRSEG" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="SEG1PH" edc:desc="" edc:mask="0x7" edc:name="SEG1PH" edc:nzwidth="0x3"/>
              <edc:SFRFieldDef edc:cname="SAM" edc:desc="" edc:mask="0x1" edc:name="SAM" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2PHTS" edc:desc="" edc:mask="0x1" edc:name="SEG2PHTS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH" edc:desc="" edc:mask="0x7" edc:name="SEG2PH" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="WAKFIL" edc:desc="" edc:mask="0x1" edc:name="WAKFIL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PRSEG0" edc:desc="" edc:mask="0x1" edc:name="PRSEG0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRSEG1" edc:desc="" edc:mask="0x1" edc:name="PRSEG1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PRSEG2" edc:desc="" edc:mask="0x1" edc:name="PRSEG2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH0" edc:desc="" edc:mask="0x1" edc:name="SEG1PH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH1" edc:desc="" edc:mask="0x1" edc:name="SEG1PH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG1PH2" edc:desc="" edc:mask="0x1" edc:name="SEG1PH2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="SEG2PH0" edc:desc="" edc:mask="0x1" edc:name="SEG2PH0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH1" edc:desc="" edc:mask="0x1" edc:name="SEG2PH1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SEG2PH2" edc:desc="" edc:mask="0x1" edc:name="SEG2PH2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="ccrrrrrrnnnnnnnn" edc:cname="C1INTF" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1INTF" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0IF" edc:desc="" edc:mask="0x1" edc:name="RXB0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1IF" edc:desc="" edc:mask="0x1" edc:name="RXB1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0IF" edc:desc="" edc:mask="0x1" edc:name="TXB0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1IF" edc:desc="" edc:mask="0x1" edc:name="TXB1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2IF" edc:desc="" edc:mask="0x1" edc:name="TXB2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERRIF" edc:desc="" edc:mask="0x1" edc:name="ERRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIF" edc:desc="" edc:mask="0x1" edc:name="WAKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRXIF" edc:desc="" edc:mask="0x1" edc:name="IRXIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EWARN" edc:desc="" edc:mask="0x1" edc:name="EWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXWARN" edc:desc="" edc:mask="0x1" edc:name="RXWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWARN" edc:desc="" edc:mask="0x1" edc:name="TXWARN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBP" edc:desc="" edc:mask="0x1" edc:name="RXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBP" edc:desc="" edc:mask="0x1" edc:name="TXBP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXBO" edc:desc="" edc:mask="0x1" edc:name="TXBO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1OVFL" edc:desc="" edc:mask="0x1" edc:name="RXB1OVFL" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB0OVFL" edc:desc="" edc:mask="0x1" edc:name="RXB0OVFL" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RX0IF" edc:desc="" edc:mask="0x1" edc:name="RX0IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX1IF" edc:desc="" edc:mask="0x1" edc:name="RX1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX0IF" edc:desc="" edc:mask="0x1" edc:name="TX0IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX1IF" edc:desc="" edc:mask="0x1" edc:name="TX1IF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2IF" edc:desc="" edc:mask="0x1" edc:name="TX2IF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IVRIF" edc:desc="" edc:mask="0x1" edc:name="IVRIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RXWAR" edc:desc="" edc:mask="0x1" edc:name="RXWAR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXWAR" edc:desc="" edc:mask="0x1" edc:name="TXWAR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXEP" edc:desc="" edc:mask="0x1" edc:name="RXEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEP" edc:desc="" edc:mask="0x1" edc:name="TXEP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RX1OVR" edc:desc="" edc:mask="0x1" edc:name="RX1OVR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX0OVR" edc:desc="" edc:mask="0x1" edc:name="RX0OVR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--------nnnnnnnn" edc:cname="C1INTE" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------00000000" edc:name="C1INTE" edc:nzwidth="0x10" edc:por="--------00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0IE" edc:desc="" edc:mask="0x1" edc:name="RXB0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1IE" edc:desc="" edc:mask="0x1" edc:name="RXB1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0IE" edc:desc="" edc:mask="0x1" edc:name="TXB0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1IE" edc:desc="" edc:mask="0x1" edc:name="TXB1IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2IE" edc:desc="" edc:mask="0x1" edc:name="TXB2IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERRIE" edc:desc="" edc:mask="0x1" edc:name="ERRIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIE" edc:desc="" edc:mask="0x1" edc:name="WAKIE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRXIE" edc:desc="" edc:mask="0x1" edc:name="IRXIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="RX0IE" edc:desc="" edc:mask="0x1" edc:name="RX0IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX1IE" edc:desc="" edc:mask="0x1" edc:name="RX1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX0IE" edc:desc="" edc:mask="0x1" edc:name="TX0IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX1IE" edc:desc="" edc:mask="0x1" edc:name="TX1IE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX2IE" edc:desc="" edc:mask="0x1" edc:name="TX2IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="IVRIE" edc:desc="" edc:mask="0x1" edc:name="IVRIE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrrrrrrrrrr" edc:cname="C1EC" edc:desc="" edc:impl="0xffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000000" edc:name="C1EC" edc:nzwidth="0x10" edc:por="0000000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="REC" edc:desc="" edc:mask="0xff" edc:name="REC" edc:nzwidth="0x8"/>
              <edc:SFRFieldDef edc:cname="TEC" edc:desc="" edc:mask="0xff" edc:name="TEC" edc:nzwidth="0x8"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="REC0" edc:desc="" edc:mask="0x1" edc:name="REC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC1" edc:desc="" edc:mask="0x1" edc:name="REC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC2" edc:desc="" edc:mask="0x1" edc:name="REC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC3" edc:desc="" edc:mask="0x1" edc:name="REC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC4" edc:desc="" edc:mask="0x1" edc:name="REC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC5" edc:desc="" edc:mask="0x1" edc:name="REC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC6" edc:desc="" edc:mask="0x1" edc:name="REC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="REC7" edc:desc="" edc:mask="0x1" edc:name="REC7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC0" edc:desc="" edc:mask="0x1" edc:name="TEC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC1" edc:desc="" edc:mask="0x1" edc:name="TEC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC2" edc:desc="" edc:mask="0x1" edc:name="TEC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC3" edc:desc="" edc:mask="0x1" edc:name="TEC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC4" edc:desc="" edc:mask="0x1" edc:name="TEC4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC5" edc:desc="" edc:mask="0x1" edc:name="TEC5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC6" edc:desc="" edc:mask="0x1" edc:name="TEC6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TEC7" edc:desc="" edc:mask="0x1" edc:name="TEC7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="932"/>
        <edc:SFRDef edc:access="nn------nnnnnnnn" edc:cname="RCON" edc:desc="" edc:impl="0xc0ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu------1uuuuuuu" edc:name="RCON" edc:nzwidth="0x10" edc:por="00------00000011">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="POR" edc:desc="" edc:mask="0x1" edc:name="POR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BOR" edc:desc="" edc:mask="0x1" edc:name="BOR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IDLE" edc:desc="" edc:mask="0x1" edc:name="IDLE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SLEEP" edc:desc="" edc:mask="0x1" edc:name="SLEEP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WDTO" edc:desc="" edc:mask="0x1" edc:name="WDTO" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWDTEN" edc:desc="" edc:mask="0x1" edc:name="SWDTEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SWR" edc:desc="" edc:mask="0x1" edc:name="SWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EXTR" edc:desc="" edc:mask="0x1" edc:name="EXTR" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="IOPUWR" edc:desc="" edc:mask="0x1" edc:name="IOPUWR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRAPR" edc:desc="" edc:mask="0x1" edc:name="TRAPR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--rr--nnnnr-c-nn" edc:cname="OSCCON" edc:desc="" edc:impl="0x33eb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--yy--yy000-0-00" edc:name="OSCCON" edc:nzwidth="0x10" edc:por="--yy--yy000-0-00">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="OSWEN" edc:desc="" edc:mask="0x1" edc:name="OSWEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="LPOSCEN" edc:desc="" edc:mask="0x1" edc:name="LPOSCEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CF" edc:desc="" edc:mask="0x1" edc:name="CF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LOCK" edc:desc="" edc:mask="0x1" edc:name="LOCK" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="POST" edc:desc="" edc:mask="0x3" edc:name="POST" edc:nzwidth="0x2"/>
              <edc:SFRFieldDef edc:cname="NOSC" edc:desc="" edc:mask="0x3" edc:name="NOSC" edc:nzwidth="0x2"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="COSC" edc:desc="" edc:mask="0x3" edc:name="COSC" edc:nzwidth="0x2"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="POST0" edc:desc="" edc:mask="0x1" edc:name="POST0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="POST1" edc:desc="" edc:mask="0x1" edc:name="POST1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC0" edc:desc="" edc:mask="0x1" edc:name="NOSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="NOSC1" edc:desc="" edc:mask="0x1" edc:name="NOSC1" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="COSC0" edc:desc="" edc:mask="0x1" edc:name="COSC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="COSC1" edc:desc="" edc:mask="0x1" edc:name="COSC1" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="28"/>
        <edc:SFRDef edc:access="nnn------nnnnnnn" edc:cname="NVMCON" edc:desc="" edc:impl="0xe07f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000------0000000" edc:name="NVMCON" edc:nzwidth="0x10" edc:por="000------0000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="PROGOP" edc:desc="" edc:mask="0x7f" edc:name="PROGOP" edc:nzwidth="0x7"/>
              <edc:AdjustPoint edc:offset="6"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="PROGOP0" edc:desc="" edc:mask="0x1" edc:name="PROGOP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP1" edc:desc="" edc:mask="0x1" edc:name="PROGOP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP2" edc:desc="" edc:mask="0x1" edc:name="PROGOP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP3" edc:desc="" edc:mask="0x1" edc:name="PROGOP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP4" edc:desc="" edc:mask="0x1" edc:name="PROGOP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP5" edc:desc="" edc:mask="0x1" edc:name="PROGOP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="PROGOP6" edc:desc="" edc:mask="0x1" edc:name="PROGOP6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="r" edc:stimtype="Record"/>
        </edc:SFRDef>
